[Timeout] StringLiteral
src/services/profile.service.ts:29:31
     const user = await this.userRepository.findByUsername(username);
 
     if (!user) {
-      throw new NotFoundError('Profile', username);
+      throw new NotFoundError("", username);
     }
 

[Timeout] BooleanLiteral
src/services/profile.service.ts:34:9
 
     const following = currentUserId
       ? await this.profileRepository.isFollowing(currentUserId, user.id)
-      : false;
+      : true;
 
     return {

[Killed] BlockStatement
src/services/profile.service.ts:62:42
     }
 
     // Cannot follow yourself
-    if (targetUser.id === currentUserId) {
-      throw new NotFoundError('Profile', username);
-    }
+    if (targetUser.id === currentUserId) {}
 
     await this.profileRepository.follow(currentUserId, targetUser.id);
killedBy: ProfileService followUser follow_yourself_throws_not_found_error
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"bio": "I like coding", "following": true, "image": "https://example.com/avatar.jpg", "username": "johndoe"}

[Killed] EqualityOperator
src/services/profile.service.ts:62:9
     }
 
     // Cannot follow yourself
-    if (targetUser.id === currentUserId) {
+    if (targetUser.id !== currentUserId) {
       throw new NotFoundError('Profile', username);
     }
killedBy: ProfileService followUser follow_existing_user_creates_follow_relationship
statusReason: NotFoundError: Profile with identifier 'janedoe' not found

[Killed] StringLiteral
src/services/profile.service.ts:63:31
 
     // Cannot follow yourself
     if (targetUser.id === currentUserId) {
-      throw new NotFoundError('Profile', username);
+      throw new NotFoundError("", username);
     }
 
killedBy: ProfileService followUser follow_yourself_throws_not_found_error
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Profile"
Received message:   " with identifier 'johndoe' not found"

      116 |         } else {
      117 |           stryCov_9fa48("235");
    > 118 |           throw new NotFoundError(stryMutAct_9fa48("236") ? "" : (stryCov_9fa48("236"), 'Profile'), username);

[Killed] BooleanLiteral
src/services/profile.service.ts:72:18
       username: targetUser.username,
       bio: targetUser.bio,
       image: targetUser.image,
-      following: true
+      following: false
     };
   }
killedBy: ProfileService followUser follow_existing_user_creates_follow_relationship
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "bio": "I like testing",
-   "following": true,

[Killed] BooleanLiteral
src/services/profile.service.ts:99:18
       username: targetUser.username,
       bio: targetUser.bio,
       image: targetUser.image,
-      following: false
+      following: true
     };
   }
killedBy: ProfileService unfollowUser unfollow_existing_user_removes_follow_relationship
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "bio": "I like testing",
-   "following": false,
