[Timeout] ConditionalExpression
src/services/article.service.ts:37:33
   ): Promise<ArticleResponse> {
     const slug = await this.generateUniqueSlug(dto.title);
 
-    const tags = dto.tagList && dto.tagList.length > 0
+    const tags = dto.tagList && true
       ? await this.tagRepository.upsertMany(dto.tagList)
       : [];

[Timeout] EqualityOperator
src/services/article.service.ts:37:33
   ): Promise<ArticleResponse> {
     const slug = await this.generateUniqueSlug(dto.title);
 
-    const tags = dto.tagList && dto.tagList.length > 0
+    const tags = dto.tagList && dto.tagList.length <= 0
       ? await this.tagRepository.upsertMany(dto.tagList)
       : [];

[Killed] BlockStatement
src/services/article.service.ts:134:45
       throw new NotFoundError('Article', slug);
     }
 
-    if (article.authorId !== currentUserId) {
-      throw new AuthorizationError('Only the author can update this article');
-    }
+    if (article.authorId !== currentUserId) {}
 
     let newSlug: string | undefined;
killedBy: ArticleService updateArticle update_article_by_non_author_throws_authorization_error
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Only the author can update"
Received message:   "Cannot read properties of undefined (reading 'author')"

      302 |     } else {
      303 |       stryCov_9fa48("80");
    > 304 |       const following = currentUserId ? await this.profileRepository.isFollowing(currentUserId, article.author.id) : stryMutAct_9fa48("81") ? true

[Killed] EqualityOperator
src/services/article.service.ts:134:9
       throw new NotFoundError('Article', slug);
     }
 
-    if (article.authorId !== currentUserId) {
+    if (article.authorId === currentUserId) {
       throw new AuthorizationError('Only the author can update this article');
     }
killedBy: ArticleService updateArticle update_article_by_author_succeeds
statusReason: AuthorizationError: Only the author can update this article

[Killed] ConditionalExpression
src/services/article.service.ts:140:22
 
     let newSlug: string | undefined;
 
-    if (dto.title && dto.title !== article.title) {
+    if (dto.title && true) {
       newSlug = await this.generateUniqueSlug(dto.title);
     }
killedBy: ArticleService updateArticle update_article_with_same_title_does_not_regenerate_slug
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: "test-article"

[Killed] BlockStatement
src/services/article.service.ts:140:51
 
     let newSlug: string | undefined;
 
-    if (dto.title && dto.title !== article.title) {
-      newSlug = await this.generateUniqueSlug(dto.title);
-    }
+    if (dto.title && dto.title !== article.title) {}
 
     const updatedArticle = await this.articleRepository.update(slug, {
killedBy: ArticleService updateArticle update_article_title_generates_new_slug
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "test-article", ObjectContaining {"newSlug": "new-title"}
Received: "test-article", {"newSlug": undefined, "title": "New Title"}

Number of calls: 1

[Killed] BlockStatement
src/services/article.service.ts:156:75
    * Delete article.
    * Only author can delete.
    */
-  async deleteArticle(slug: string, currentUserId: number): Promise<void> {
-    const article = await this.articleRepository.findBySlug(slug);
-
-    if (!article) {
-      throw new NotFoundError('Article', slug);
-    }
-
-    if (article.authorId !== currentUserId) {
-      throw new AuthorizationError('Only the author can delete this article');
-    }
-
-    await this.articleRepository.delete(slug);
-  }
+  async deleteArticle(slug: string, currentUserId: number): Promise<void> {}
 
   /**
killedBy: ArticleService deleteArticle delete_article_by_author_succeeds
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "test-article"

Number of calls: 0

[Killed] ConditionalExpression
src/services/article.service.ts:163:9
       throw new NotFoundError('Article', slug);
     }
 
-    if (article.authorId !== currentUserId) {
+    if (false) {
       throw new AuthorizationError('Only the author can delete this article');
     }
killedBy: ArticleService deleteArticle delete_article_by_non_author_throws_authorization_error
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ConditionalExpression
src/services/article.service.ts:163:9
       throw new NotFoundError('Article', slug);
     }
 
-    if (article.authorId !== currentUserId) {
+    if (true) {
       throw new AuthorizationError('Only the author can delete this article');
     }
killedBy: ArticleService deleteArticle delete_article_by_author_succeeds
statusReason: AuthorizationError: Only the author can delete this article

[Killed] MethodExpression
src/services/article.service.ts:210:22
    * Appends counter if slug exists.
    */
   private async generateUniqueSlug(title: string): Promise<string> {
-    const baseSlug = title
-      .toLowerCase()
-      .trim()
+    const baseSlug = title.toLowerCase()
       .replace(/[^\w\s-]/g, '')
       .replace(/\s+/g, '-')
killedBy: ArticleService createArticle create_article_strips_leading_trailing_whitespace_from_slug
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "hello-world"
Received: "-hello-world-"

Number of calls: 1

[Killed] MethodExpression
src/services/article.service.ts:210:22
    * Appends counter if slug exists.
    */
   private async generateUniqueSlug(title: string): Promise<string> {
-    const baseSlug = title
-      .toLowerCase()
+    const baseSlug = title.toUpperCase()
       .trim()
       .replace(/[^\w\s-]/g, '')
killedBy: ArticleService createArticle create_article_with_duplicate_slug_appends_counter
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "test-article"
Received
       1: "TEST-ARTICLE"
       2: "TEST-ARTICLE-2"

Number of calls: 2

[Killed] Regex
src/services/article.service.ts:213:16
     const baseSlug = title
       .toLowerCase()
       .trim()
-      .replace(/[^\w\s-]/g, '')
+      .replace(/[^\W\s-]/g, '')
       .replace(/\s+/g, '-')
       .replace(/-+/g, '-');
killedBy: ArticleService createArticle create_article_with_duplicate_slug_appends_counter
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "test-article"
Received
       1: "-"
       2: "--2"

Number of calls: 2

[Survived] Regex
src/services/article.service.ts:214:16
       .toLowerCase()
       .trim()
       .replace(/[^\w\s-]/g, '')
-      .replace(/\s+/g, '-')
+      .replace(/\s/g, '-')
       .replace(/-+/g, '-');
 

[Killed] Regex
src/services/article.service.ts:215:16
       .trim()
       .replace(/[^\w\s-]/g, '')
       .replace(/\s+/g, '-')
-      .replace(/-+/g, '-');
+      .replace(/-/g, '-');
 
     let slug = baseSlug;
killedBy: ArticleService createArticle create_article_collapses_consecutive_hyphens_in_slug
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "test-article"
Received: "test--article"

Number of calls: 1

[Killed] BlockStatement
src/services/article.service.ts:220:59
     let slug = baseSlug;
     let counter = 2;
 
-    while (await this.articleRepository.slugExists(slug)) {
-      slug = `${baseSlug}-${counter}`;
-      counter++;
-    }
+    while (await this.articleRepository.slugExists(slug)) {}
 
     return slug;
killedBy: ArticleService createArticle create_article_with_duplicate_slug_appends_counter
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "test-article-2"
Received
       1: "test-article"
       2: "test-article"

Number of calls: 2

[Killed] ConditionalExpression
src/services/article.service.ts:220:12
     let slug = baseSlug;
     let counter = 2;
 
-    while (await this.articleRepository.slugExists(slug)) {
+    while (false) {
       slug = `${baseSlug}-${counter}`;
       counter++;
killedBy: ArticleService createArticle create_article_with_duplicate_slug_appends_counter
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "test-article"

Number of calls: 0

[Killed] StringLiteral
src/services/article.service.ts:221:14
     let counter = 2;
 
     while (await this.articleRepository.slugExists(slug)) {
-      slug = `${baseSlug}-${counter}`;
+      slug = ``;
       counter++;
     }
killedBy: ArticleService createArticle create_article_with_duplicate_slug_appends_counter
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "test-article-2"
Received
       1: "test-article"
       2: ""

Number of calls: 2

[Killed] UpdateOperator
src/services/article.service.ts:222:7
 
     while (await this.articleRepository.slugExists(slug)) {
       slug = `${baseSlug}-${counter}`;
-      counter++;
+      counter--;
     }
 
killedBy: ArticleService createArticle create_article_with_two_duplicate_slugs_increments_counter_to_three
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "test-article-3"
Received
       1: "test-article"
       2: "test-article-2"
       3: "test-article-1"

[Killed] BooleanLiteral
src/services/article.service.ts:237:9
   ): Promise<ArticleResponse> {
     const following = currentUserId
       ? await this.profileRepository.isFollowing(currentUserId, article.author.id)
-      : false;
+      : true;
 
     const favorited = currentUserId
killedBy: ArticleService getArticle get_existing_article_returns_article_with_author
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/services/article.service.ts:240:41
       : false;
 
     const favorited = currentUserId
-      ? article.favoritedBy.some((f) => f.userId === currentUserId)
+      ? article.favoritedBy.some((f) => f.userId !== currentUserId)
       : false;
 
killedBy: ArticleService favoriteArticle favorite_article_updates_favorited_status
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] MethodExpression
src/services/article.service.ts:240:9
       : false;
 
     const favorited = currentUserId
-      ? article.favoritedBy.some((f) => f.userId === currentUserId)
+      ? article.favoritedBy.every(f => f.userId === currentUserId)
       : false;
 
killedBy: ArticleService unfavoriteArticle unfavorite_article_updates_favorited_status
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/services/article.service.ts:241:9
 
     const favorited = currentUserId
       ? article.favoritedBy.some((f) => f.userId === currentUserId)
-      : false;
+      : true;
 
     return {
killedBy: ArticleService getArticle get_existing_article_returns_article_with_author
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ArrowFunction
src/services/article.service.ts:274:34
       : false;
 
     const favorited = currentUserId
-      ? article.favoritedBy.some((f) => f.userId === currentUserId)
+      ? article.favoritedBy.some(() => undefined)
       : false;
 
killedBy: ArticleService listArticles list_articles_shows_favorited_true_when_user_has_favorited
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/services/article.service.ts:274:41
       : false;
 
     const favorited = currentUserId
-      ? article.favoritedBy.some((f) => f.userId === currentUserId)
+      ? article.favoritedBy.some((f) => true)
       : false;
 
killedBy: ArticleService listArticles list_articles_shows_favorited_false_when_user_has_not_favorited
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/services/article.service.ts:297:9
 
   private validateLimit(limit?: number): number {
     if (limit === undefined) return DEFAULT_LIMIT;
-    if (limit < 1) return DEFAULT_LIMIT;
+    if (limit >= 1) return DEFAULT_LIMIT;
     if (limit > MAX_LIMIT) return MAX_LIMIT;
     return limit;
killedBy: ArticleService listArticles list_articles_clamps_limit_above_max_to_max_limit
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"limit": 100}
Received: {"limit": 20, "offset": 0}

Number of calls: 1

[Killed] EqualityOperator
src/services/article.service.ts:297:9
 
   private validateLimit(limit?: number): number {
     if (limit === undefined) return DEFAULT_LIMIT;
-    if (limit < 1) return DEFAULT_LIMIT;
+    if (limit <= 1) return DEFAULT_LIMIT;
     if (limit > MAX_LIMIT) return MAX_LIMIT;
     return limit;
killedBy: ArticleService listArticles list_articles_with_limit_one_uses_exactly_one
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"limit": 1}
Received: {"limit": 20, "offset": 0}

Number of calls: 1

[Killed] EqualityOperator
src/services/article.service.ts:298:9
   private validateLimit(limit?: number): number {
     if (limit === undefined) return DEFAULT_LIMIT;
     if (limit < 1) return DEFAULT_LIMIT;
-    if (limit > MAX_LIMIT) return MAX_LIMIT;
+    if (limit <= MAX_LIMIT) return MAX_LIMIT;
     return limit;
   }
killedBy: ArticleService listArticles list_articles_clamps_limit_above_max_to_max_limit
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"limit": 100}
Received: {"limit": 999, "offset": 0}

Number of calls: 1

[Killed] ConditionalExpression
src/services/article.service.ts:298:9
   private validateLimit(limit?: number): number {
     if (limit === undefined) return DEFAULT_LIMIT;
     if (limit < 1) return DEFAULT_LIMIT;
-    if (limit > MAX_LIMIT) return MAX_LIMIT;
+    if (false) return MAX_LIMIT;
     return limit;
   }
killedBy: ArticleService listArticles list_articles_clamps_limit_above_max_to_max_limit
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"limit": 100}
Received: {"limit": 999, "offset": 0}

Number of calls: 1

[Killed] ConditionalExpression
src/services/article.service.ts:304:9
 
   private validateOffset(offset?: number): number {
     if (offset === undefined) return DEFAULT_OFFSET;
-    if (offset < 0) return DEFAULT_OFFSET;
+    if (false) return DEFAULT_OFFSET;
     return offset;
   }
killedBy: ArticleService listArticles list_articles_clamps_negative_offset_to_default
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"offset": 0}
Received: {"limit": 20, "offset": -1}

Number of calls: 1

[Killed] EqualityOperator
src/services/article.service.ts:304:9
 
   private validateOffset(offset?: number): number {
     if (offset === undefined) return DEFAULT_OFFSET;
-    if (offset < 0) return DEFAULT_OFFSET;
+    if (offset >= 0) return DEFAULT_OFFSET;
     return offset;
   }
killedBy: ArticleService listArticles list_articles_clamps_negative_offset_to_default
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"offset": 0}
Received: {"limit": 20, "offset": -1}

Number of calls: 1
