[Killed] ConditionalExpression
src/services/comment.service.ts:34:9
   ): Promise<MultipleCommentsResponse> {
     const article = await this.articleRepository.findBySlug(slug);
 
-    if (!article) {
+    if (true) {
       throw new NotFoundError('Article', slug);
     }
killedBy: CommentService getComments get_comments_for_existing_article_returns_comments_list
statusReason: NotFoundError: Article with identifier 'test-article' not found

[Timeout] StringLiteral
src/services/comment.service.ts:35:31
     const article = await this.articleRepository.findBySlug(slug);
 
     if (!article) {
-      throw new NotFoundError('Article', slug);
+      throw new NotFoundError("", slug);
     }
 

[Killed] BlockStatement
src/services/comment.service.ts:89:20
     slug: string,
     commentId: number,
     currentUserId: number
-  ): Promise<void> {
-    const article = await this.articleRepository.findBySlug(slug);
-
-    if (!article) {
-      throw new NotFoundError('Article', slug);
-    }
-
-    const comment = await this.commentRepository.findById(commentId);
-
-    if (!comment) {
-      throw new NotFoundError('Comment', commentId);
-    }
-
-    if (comment.authorId !== currentUserId) {
-      throw new AuthorizationError('Only the comment author can delete this comment');
-    }
-
-    await this.commentRepository.delete(commentId);
-  }
+  ): Promise<void> {}
 
   /**
killedBy: CommentService deleteComment delete_comment_by_author_succeeds
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1

Number of calls: 0

[Killed] BlockStatement
src/services/comment.service.ts:92:19
   ): Promise<void> {
     const article = await this.articleRepository.findBySlug(slug);
 
-    if (!article) {
-      throw new NotFoundError('Article', slug);
-    }
+    if (!article) {}
 
     const comment = await this.commentRepository.findById(commentId);
killedBy: CommentService deleteComment delete_comment_for_nonexistent_article_throws_not_found_error
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Article"
Received message:   "Only the comment author can delete this comment"

      154 |         } else {
      155 |           stryCov_9fa48("212");
    > 156 |           throw new AuthorizationError(stryMutAct_9fa48("213") ? "" : (stryCov_9fa48("213"), 'Only the comment author can delete this comment'));

[Killed] StringLiteral
src/services/comment.service.ts:99:31
     const comment = await this.commentRepository.findById(commentId);
 
     if (!comment) {
-      throw new NotFoundError('Comment', commentId);
+      throw new NotFoundError("", commentId);
     }
 
killedBy: CommentService deleteComment delete_nonexistent_comment_throws_not_found_error
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Comment"
Received message:   " with identifier '999' not found"

      146 |         } else {
      147 |           stryCov_9fa48("207");
    > 148 |           throw new NotFoundError(stryMutAct_9fa48("208") ? "" : (stryCov_9fa48("208"), 'Comment'), commentId);

[Killed] EqualityOperator
src/services/comment.service.ts:102:9
       throw new NotFoundError('Comment', commentId);
     }
 
-    if (comment.authorId !== currentUserId) {
+    if (comment.authorId === currentUserId) {
       throw new AuthorizationError('Only the comment author can delete this comment');
     }
killedBy: CommentService deleteComment delete_comment_by_author_succeeds
statusReason: AuthorizationError: Only the comment author can delete this comment

[Killed] BlockStatement
src/services/comment.service.ts:102:45
       throw new NotFoundError('Comment', commentId);
     }
 
-    if (comment.authorId !== currentUserId) {
-      throw new AuthorizationError('Only the comment author can delete this comment');
-    }
+    if (comment.authorId !== currentUserId) {}
 
     await this.commentRepository.delete(commentId);
killedBy: CommentService deleteComment delete_comment_by_non_author_throws_authorization_error
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] StringLiteral
src/services/comment.service.ts:103:36
     }
 
     if (comment.authorId !== currentUserId) {
-      throw new AuthorizationError('Only the comment author can delete this comment');
+      throw new AuthorizationError("");
     }
 
killedBy: CommentService deleteComment delete_comment_by_non_author_throws_authorization_error
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Only the comment author can delete this comment"
Received message:   ""

      154 |         } else {
      155 |           stryCov_9fa48("212");
    > 156 |           throw new AuthorizationError(stryMutAct_9fa48("213") ? "" : (stryCov_9fa48("213"), 'Only the comment author can delete this comment'));

[Killed] BooleanLiteral
src/services/comment.service.ts:118:9
   ): Promise<CommentResponse> {
     const following = currentUserId
       ? await this.profileRepository.isFollowing(currentUserId, comment.author.id)
-      : false;
+      : true;
 
     return {
killedBy: CommentService getComments get_comments_for_existing_article_returns_comments_list
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 1
+ Received  + 1

  Object {
    "author": Object {
-     "following": false,
