[Timeout] StringLiteral
src/services/auth.service.ts:48:37
     const user = await this.userRepository.findByEmail(dto.email);
 
     if (!user) {
-      throw new AuthenticationError('Email or password is invalid');
+      throw new AuthenticationError("");
     }
 

[Killed] BlockStatement
src/services/auth.service.ts:53:27
 
     const isPasswordValid = await this.verifyPassword(dto.password, user.passwordHash);
 
-    if (!isPasswordValid) {
-      throw new AuthenticationError('Email or password is invalid');
-    }
+    if (!isPasswordValid) {}
 
     return this.buildUserResponse(user);
killedBy: AuthService login login_with_invalid_password_throws_authentication_error
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"bio": null, "email": "test@example.com", "image": null, "token": "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJ1c2VySWQiOjEsImlhdCI6MTc3MzQyODE4MSwiZXhwIjoxNzc2MDIwMTgxfQ.gtWWG4YOVCNJofRA_tP0A0zxooKsKtUOxzeJrtlhRCg", "username": "testuser"}

[Killed] ConditionalExpression
src/services/auth.service.ts:53:9
 
     const isPasswordValid = await this.verifyPassword(dto.password, user.passwordHash);
 
-    if (!isPasswordValid) {
+    if (false) {
       throw new AuthenticationError('Email or password is invalid');
     }
killedBy: AuthService login login_with_invalid_password_throws_authentication_error
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"bio": null, "email": "test@example.com", "image": null, "token": "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJ1c2VySWQiOjEsImlhdCI6MTc3MzQyODE3OCwiZXhwIjoxNzc2MDIwMTc4fQ.qTu0mo1I2sCDSVhGvxeraOY0YBS89uJH4TGxl7IyUdo", "username": "testuser"}

[Killed] StringLiteral
src/services/auth.service.ts:68:31
     const user = await this.userRepository.findById(userId);
 
     if (!user) {
-      throw new NotFoundError('User', userId);
+      throw new NotFoundError("", userId);
     }
 
killedBy: AuthService getUserById get_nonexistent_user_throws_not_found_error
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "User"
Received message:   " with identifier '999' not found"

      128 |         } else {
      129 |           stryCov_9fa48("139");
    > 130 |           throw new NotFoundError(stryMutAct_9fa48("140") ? "" : (stryCov_9fa48("140"), 'User'), userId);

[Killed] ConditionalExpression
src/services/auth.service.ts:86:22
       throw new NotFoundError('User', userId);
     }
 
-    if (dto.email && dto.email !== user.email) {
+    if (dto.email && true) {
       await this.validateUniqueEmail(dto.email);
     }
killedBy: AuthService updateUser update_user_with_same_email_skips_uniqueness_check
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: "test@example.com"

[Killed] EqualityOperator
src/services/auth.service.ts:86:22
       throw new NotFoundError('User', userId);
     }
 
-    if (dto.email && dto.email !== user.email) {
+    if (dto.email && dto.email === user.email) {
       await this.validateUniqueEmail(dto.email);
     }
killedBy: AuthService updateUser update_user_with_new_email_validates_uniqueness
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected constructor: ValidationError
Received constructor: TypeError

Received message: "Cannot read properties of undefined (reading 'email')"

      310 |       stryCov_9fa48("181");

[Killed] EqualityOperator
src/services/auth.service.ts:90:25
       await this.validateUniqueEmail(dto.email);
     }
 
-    if (dto.username && dto.username !== user.username) {
+    if (dto.username && dto.username === user.username) {
       await this.validateUniqueUsername(dto.username);
     }
killedBy: AuthService updateUser update_user_with_same_username_skips_uniqueness_check
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: "testuser"

[Killed] ConditionalExpression
src/services/auth.service.ts:90:25
       await this.validateUniqueEmail(dto.email);
     }
 
-    if (dto.username && dto.username !== user.username) {
+    if (dto.username && true) {
       await this.validateUniqueUsername(dto.username);
     }
killedBy: AuthService updateUser update_user_with_same_username_skips_uniqueness_check
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: "testuser"

[Killed] BlockStatement
src/services/auth.service.ts:96:23
 
     const updateData: UpdateUserDTO & { passwordHash?: string } = { ...dto };
 
-    if (dto.password) {
-      updateData.passwordHash = await this.hashPassword(dto.password);
-      delete updateData.password;
-    }
+    if (dto.password) {}
 
     const updatedUser = await this.userRepository.update(userId, updateData);
killedBy: AuthService updateUser update_user_with_password_hashes_password_before_save
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1, ObjectContaining {"passwordHash": Any<String>}
Received: 1, {"password": "newpassword123"}

Number of calls: 1

[Killed] BlockStatement
src/services/auth.service.ts:144:67
    * Validate email is not already taken.
    * @throws ValidationError if email exists
    */
-  private async validateUniqueEmail(email: string): Promise<void> {
-    const existing = await this.userRepository.findByEmail(email);
-    if (existing) {
-      throw new ValidationError('Email is already taken');
-    }
-  }
+  private async validateUniqueEmail(email: string): Promise<void> {}
 
   /**
killedBy: AuthService register register_with_duplicate_email_throws_validation_error
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Email is already taken"
Received message:   "Cannot read properties of undefined (reading 'email')"

      310 |       stryCov_9fa48("181");
      311 |       return stryMutAct_9fa48("182") ? {} : (stryCov_9fa48("182"), {
    > 312 |         email: user.email,

[Killed] ConditionalExpression
src/services/auth.service.ts:146:9
    */
   private async validateUniqueEmail(email: string): Promise<void> {
     const existing = await this.userRepository.findByEmail(email);
-    if (existing) {
+    if (false) {
       throw new ValidationError('Email is already taken');
     }
killedBy: AuthService register register_with_duplicate_email_throws_validation_error
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Email is already taken"
Received message:   "Cannot read properties of undefined (reading 'email')"

      310 |       stryCov_9fa48("181");
      311 |       return stryMutAct_9fa48("182") ? {} : (stryCov_9fa48("182"), {
    > 312 |         email: user.email,

[Killed] ConditionalExpression
src/services/auth.service.ts:146:9
    */
   private async validateUniqueEmail(email: string): Promise<void> {
     const existing = await this.userRepository.findByEmail(email);
-    if (existing) {
+    if (true) {
       throw new ValidationError('Email is already taken');
     }
killedBy: AuthService register creates_user_with_valid_data_returns_user_response_with_token
statusReason: ValidationError: Email is already taken

[Killed] BlockStatement
src/services/auth.service.ts:155:73
    * Validate username is not already taken.
    * @throws ValidationError if username exists
    */
-  private async validateUniqueUsername(username: string): Promise<void> {
-    const existing = await this.userRepository.findByUsername(username);
-    if (existing) {
-      throw new ValidationError('Username is already taken');
-    }
-  }
+  private async validateUniqueUsername(username: string): Promise<void> {}
 
   /**
killedBy: AuthService register register_with_duplicate_username_throws_validation_error
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Username is already taken"
Received message:   "Cannot read properties of undefined (reading 'email')"

      310 |       stryCov_9fa48("181");
      311 |       return stryMutAct_9fa48("182") ? {} : (stryCov_9fa48("182"), {
    > 312 |         email: user.email,

[Killed] ConditionalExpression
src/services/auth.service.ts:157:9
    */
   private async validateUniqueUsername(username: string): Promise<void> {
     const existing = await this.userRepository.findByUsername(username);
-    if (existing) {
+    if (true) {
       throw new ValidationError('Username is already taken');
     }
killedBy: AuthService register creates_user_with_valid_data_returns_user_response_with_token
statusReason: ValidationError: Username is already taken

[Killed] BlockStatement
src/services/auth.service.ts:157:19
    */
   private async validateUniqueUsername(username: string): Promise<void> {
     const existing = await this.userRepository.findByUsername(username);
-    if (existing) {
-      throw new ValidationError('Username is already taken');
-    }
+    if (existing) {}
   }
 
killedBy: AuthService register register_with_duplicate_username_throws_validation_error
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Username is already taken"
Received message:   "Cannot read properties of undefined (reading 'email')"

      310 |       stryCov_9fa48("181");
      311 |       return stryMutAct_9fa48("182") ? {} : (stryCov_9fa48("182"), {
    > 312 |         email: user.email,
